[
    {
        "id": 1,
        "name": "机械工程系"
    },
    {
        "id": 2,
        "name": "电子工程系"
    },
    {
        "id": 3,
        "name": "自动化系"
    },
    {
        "id": 4,
        "name": "化学与化工系"
    },
    {
        "id": 5,
        "name": "计算机工程系"
    },
    {
        "id": 6,
        "name": "环境与安全工程系"
    },
    {
        "id": 7,
        "name": "材料工程系"
    },
    {
        "id": 8,
        "name": "理学系"
    },
    {
        "id": 9,
        "name": "经济与管理系"
    },
    {
        "id": 10,
        "name": "外语系"
    },
    {
        "id": 11,
        "name": "设计艺术系"
    },
    {
        "id": 12,
        "name": "思政部与法学系"
    },
    {
        "id": 13,
        "name": "体育系"
    }
]